Revit 2027 API
BuiltInFailures.PropertySetElementFailures.NonStringParameterValue Property
 The given parameter requires a string value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NonStringParameterValue { get; }
Public Shared ReadOnly Property NonStringParameterValue As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NonStringParameterValue {
	FailureDefinitionId^ get ();
}
static member NonStringParameterValue : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PropertySetElementFailures Class
Autodesk.Revit.DB Namespace